app/views/videos/index.html.haml

SELECT "videos".* FROM "videos"
---
    %article.row
      - category.videos.each do |video|
        .video.col-md-2