app/controllers/videos_controller.rb

  def index
    @videos = Video.all
    @categories = Category.all
---
SELECT "videos".* FROM "videos"
SELECT "categories".* FROM "categories"

  def show
    @video = Video.find_by_id(params[:id])
---
SELECT  "videos".* FROM "videos"  WHERE "videos"."id" = ? LIMIT 1  [["id", 2]]