app/views/categories/show.html.haml

  %article.row
    - @category.videos.each do |video|
      .video.col-md-2
---
SELECT "videos".* FROM "videos"  WHERE "videos"."category_id" = ?  ORDER BY title  [["category_id", 1]]